tslabs/zx-evo/pentevo/esp32/src/main/system.cpp

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
#include <inttypes.h>
#include <unistd.h>
#include <math.h>
#include <limits.h>
#include <sys/time.h>

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "soc/soc_caps.h"
#include "esp_log.h"
#include "esp_console.h"
#include "esp_chip_info.h"
#include "esp_sleep.h"
#include "esp_flash.h"
#if __has_include("esp_flash_chips/spi_flash_chip_driver.h")
#define HAVE_ESP_FLASH_CHIP_DRIVER_H 1
#include "esp_flash_chips/spi_flash_chip_driver.h"
#elif __has_include("spi_flash_chip_driver.h")
#define HAVE_ESP_FLASH_CHIP_DRIVER_H 1
#include "spi_flash_chip_driver.h"
#else
#define HAVE_ESP_FLASH_CHIP_DRIVER_H 0
#endif
#include "esp_partition.h"
#include "esp_system.h"
#include "esp_private/esp_clk.h"
#include <esp_crc.h>
#include "driver/rtc_io.h"
#include "driver/uart.h"
#include "argtable3/argtable3.h"
#include "sdkconfig.h"
#include <esp_heap_caps.h>
#include "esp_timer.h"

#include "main.h"
#include "esp_spi_defs.h"
#include "mem_obj.h"
#include "tracker.h"
#include "spi_slave.h"
#include "stats.h"
#include "ft8xx.h"
#include "usb_mouse.h"
#include "nvs_params.h"

using namespace stats;

#ifdef CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS
#define WITH_TASKS_INFO    1
#endif

const char TAG[] = "zf32_system";

int perf_test(int argc, char **argv)
{
#define _START(a) gettimeofday(&start, NULL); printf(a ": ");
#define _END      gettimeofday(&end, NULL); elapsed_ms = (end.tv_sec - start.tv_sec) * 1000.0 + (end.tv_usec - start.tv_usec) / 1000.0; \
                  printf("%.2fk iter/s\n", iters / elapsed_ms);
#define _END1     gettimeofday(&end, NULL); elapsed_ms = (end.tv_sec - start.tv_sec) * 1000.0 + (end.tv_usec - start.tv_usec) / 1000.0; \
                  printf("%.2f MB/s\n", TEST_BUF_SIZE / elapsed_ms / 1000);
#define _END2     gettimeofday(&end, NULL); elapsed_ms = (end.tv_sec - start.tv_sec) * 1000.0 + (end.tv_usec - start.tv_usec) / 1000.0; \
                  printf("%.2f iter/s\n", iters * 1000 / elapsed_ms);

 struct timeval start, end;
 double elapsed_ms;
 float sumf = 0;
 int sum = 0;

#define TEST_BUF_SIZE   2 * 1024 * 1024

  size_t iters;
  auto *buffer = heap_caps_malloc(TEST_BUF_SIZE, MALLOC_CAP_SPIRAM);

  if (!buffer)
  {
    printf("PSRAM allocation failed\n");
    return 1;
  }

  printf("\n");
  printf("Aligned PSRAM access\n");

  _START("Fill 32-bit")
  for (size_t i = 0; i < TEST_BUF_SIZE / sizeof(int); i++)
    ((int*)buffer)[i] = 0x01234567;
  _END1

  _START("Fill 16-bit")
  for (size_t i = 0; i < TEST_BUF_SIZE / sizeof(uint16_t); i++)
    ((uint16_t*)buffer)[i] = 0x89AB;
  _END1

  _START("Fill  8-bit")
  for (size_t i = 0; i < TEST_BUF_SIZE / sizeof(uint8_t); i++)
    ((uint8_t*)buffer)[i] = 0x55;
  _END1

  _START("Read 32-bit")
  for (size_t i = 0; i < TEST_BUF_SIZE / sizeof(int); i++)
    ((volatile int*)buffer)[i];
  _END1

  _START("Read 16-bit")
  for (size_t i = 0; i < TEST_BUF_SIZE / sizeof(uint16_t); i++)
    ((volatile uint16_t*)buffer)[i];
  _END1

  _START("Read  8-bit")
  for (size_t i = 0; i < TEST_BUF_SIZE / sizeof(uint8_t); i++)
    ((volatile uint8_t*)buffer)[i];
  _END1

  printf("\n");
  printf("Unaligned PSRAM access\n");

  _START("Fill 32-bit")
  for (size_t i = 0; i < TEST_BUF_SIZE / sizeof(int); i++)
    ((int*)buffer)[((i << 9) & ((TEST_BUF_SIZE / sizeof(int)) - 1)) | (i >> 8)] = 0x01234567;
  _END1

  _START("Fill 16-bit")
  for (size_t i = 0; i < TEST_BUF_SIZE / sizeof(uint16_t); i++)
    ((uint16_t*)buffer)[((i << 10) & ((TEST_BUF_SIZE / sizeof(uint16_t)) - 1)) | (i >> 9)] = (uint16_t)0x01234567;
  _END1

  _START("Fill  8-bit")
  for (size_t i = 0; i < TEST_BUF_SIZE / sizeof(uint8_t); i++)
    ((uint8_t*)buffer)[((i << 11) & (TEST_BUF_SIZE - 1)) | (i >> 10)] = 0x55;
  _END1

  _START("Read 32-bit")
  for (size_t i = 0; i < TEST_BUF_SIZE / sizeof(int); i++)
    ((volatile int*)buffer)[((i << 9) & ((TEST_BUF_SIZE / sizeof(int)) - 1)) | (i >> 8)];
  _END1

  _START("Read 16-bit")
  for (size_t i = 0; i < TEST_BUF_SIZE / sizeof(uint16_t); i++)
    ((volatile uint16_t*)buffer)[((i << 10) & ((TEST_BUF_SIZE / sizeof(uint16_t)) - 1)) | (i >> 9)];
  _END1

  _START("Read  8-bit")
  for (size_t i = 0; i < TEST_BUF_SIZE / sizeof(uint8_t); i++)
    ((volatile uint8_t*)buffer)[((i << 11) & (TEST_BUF_SIZE - 1)) | (i >> 10)];
  _END1

  printf("\n");
  printf("Math operations\n");

  iters = 100000;

  srand(esp_timer_get_time());
  _START("Rnd")
  for (size_t i = 0; i < iters; i++)
    sumf += rand();
  _END

  iters = 1000000;

  uint32_t rng_state = 123456789;
  _START("Fast rnd")
  uint32_t x = rng_state;
  for (size_t i = 0; i < iters; i++)
  {
    x ^= x << 13;
    x ^= x >> 17;
    x ^= x << 5;
    volatile auto a = x; a;
  }
  rng_state = x;
  _END

  iters = 100000;

  _START("Sqrt FP")
  for (size_t i = 0; i < iters; i++)
    sumf += sqrt((float)i);
  _END

  _START("Log FP")
  for (size_t i = 0; i < iters; i++)
    sumf += logf((float)i);
  _END

  _START("Sin FP")
  for (size_t i = 0; i < iters; i++)
    sumf += sinf((float)i);
  _END

#define WIDTH 800
#define HEIGHT 600
iters = 100;

  printf("\n");
  printf("Fractals %ux%u\n", WIDTH, HEIGHT);

  _START("Mandelbrot")
  for (int y = 0; y < HEIGHT; y++)
  {
    for (int x = 0; x < WIDTH; x++)
    {
      float cr = -2.0f + (float)x * 3.0f / WIDTH;
      float ci = -1.5f + (float)y * 3.0f / HEIGHT;
      float zr = 0.0f, zi = 0.0f;
      int iter = 0;

      while (zr * zr + zi * zi <= 4.0f && iter < iters)
      {
        float zr_new = zr * zr - zi * zi + cr;
        zi = 2.0f * zr * zi + ci;
        zr = zr_new;
        iter++;
      }

      volatile float s = (float)iter / iters; s;
    }
  }
  _END2

  _START("Julia")
  float cr = -0.4f, ci = 0.6f;

  for (int y = 0; y < HEIGHT; y++)
  {
    for (int x = 0; x < WIDTH; x++)
    {
      float zr = -2.0f + (float)x * 3.0f / WIDTH;
      float zi = -1.5f + (float)y * 3.0f / HEIGHT;
      int iter = 0;

      while (zr * zr + zi * zi <= 4.0f && iter < iters)
      {
        float zr_new = zr * zr - zi * zi + cr;
        zi = 2.0f * zr * zi + ci;
        zr = zr_new;
        iter++;
      }

      volatile float s = (float)iter / iters; s;
    }
  }
  _END2

#undef WIDTH
#undef HEIGHT

  printf("\n");

