tslabs/zx-evo/pentevo/esp32/src/main/system.cpp
  heap_caps_free(buffer);

  volatile auto s1 = sumf; s1;  // prevent optimization
  volatile auto s2 = sum; s2;   // prevent optimization

  return 0;

#undef _START
#undef _END
#undef _END1
#undef _END2
}

void hexdump(const void *data, size_t len, uint64_t base_off)
{
  const uint8_t *p = (const uint8_t *)data;

  for (size_t i = 0; i < len; i += 16)
  {
    printf("%08" PRIx64 "  ", (uint64_t)(base_off + i));

    for (size_t j = 0; j < 16; j++)
    {
      if (i + j < len) printf("%02X ", p[i + j]);
      else printf("   ");
    }

    printf(" ");

    for (size_t j = 0; j < 16; j++)
    {
      if (i + j < len)
      {
        unsigned char c = p[i + j];
        printf("%c", isprint(c) ? c : '.');
      }
    }

    printf("\r\n");
  }
}

const char *esp_status_str(uint8_t st)
{
  switch (st)
  {
    // Status codes
    case ESP_ST_IDLE:     return "Idle";
    case ESP_ST_READY:    return "Ready";
    case ESP_ST_BUSY:     return "Busy";
    case ESP_ST_DATA_M2S: return "Data Master->Slave";
    case ESP_ST_DATA_S2M: return "Data Slave->Master";
    case ESP_ST_RESET:    return "Reset performed";

    // Error codes
    case ESP_ERR_INV_COMMAND:      return "Invalid command";
    case ESP_ERR_INV_PARAM:        return "Invalid parameter";
    case ESP_ERR_INV_STATE:        return "Invalid state";
    case ESP_ERR_INV_STR_LEN:      return "Invalid string length";
    case ESP_ERR_INV_SIZE:         return "Invalid size";
    case ESP_ERR_INV_OBJ_TYPE:     return "Invalid object type";
    case ESP_ERR_INV_ARR_NUM:      return "Invalid array number";
    case ESP_ERR_INV_HANDLE:       return "Invalid handle";
    case ESP_ERR_INV_XM_HANDLE:    return "Invalid XM handle";
    case ESP_ERR_INV_LIB_HANDLE:   return "Invalid LIB handle";
    case ESP_ERR_INV_ELF_HANDLE:   return "Invalid ELF handle";
    case ESP_ERR_INV_HST_HANDLE:   return "Invalid HST handle";
    case ESP_ERR_INV_BSS_HANDLE:   return "Invalid BSS handle";
    case ESP_ERR_INV_ARG_HANDLE:   return "Invalid ARG handle";
    case ESP_ERR_INV_SRC_HANDLE:   return "Invalid source handle";
    case ESP_ERR_INV_DST_HANDLE:   return "Invalid destination handle";

    case ESP_ERR_INV_XM:           return "Invalid XM";
    case ESP_ERR_INV_LIB:          return "Invalid LIB";
    case ESP_ERR_INV_ELF:          return "Invalid ELF";
    case ESP_ERR_INV_HST:          return "Invalid HST";
    case ESP_ERR_INV_ZIP:          return "Invalid ZIP";
    case ESP_ERR_INV_S3M:          return "Invalid S3M";
    case ESP_ERR_INV_S3M_HANDLE:   return "Invalid S3M handle";

    case ESP_ERR_OUT_OF_MEMORY:    return "Out of memory";
    case ESP_ERR_OUT_OF_HANDLES:   return "Out of handles";
    case ESP_ERR_OBJ_NOT_DELETED:  return "Object not deleted";

    case ESP_ERR_AP_NOT_CONNECTED: return "AP not connected";
    case ESP_ERR_NET_BUSY:         return "Network busy";

    default:                       return "";
  }
}

int error_list(int argc, char **argv)
{
  u8 st = rd_reg8(ESP_REG_STATUS);

  for (int i = 0; i < 256; i++)
  {
    auto s = esp_status_str(i);
    if (s[0]) printf("%02X - %s\r\n", i, s);
  }

  printf("\r\n");
  printf("Current status: %02X (%s)\r\n", st, esp_status_str(st));

  return 0;
}

int get_info(int argc, char **argv)
{
  const char      *model;
  esp_chip_info_t info;
  uint32_t        flash_size;

  esp_chip_info(&info);
  model = "Unknown";

#if defined(CONFIG_IDF_TARGET_ESP32S3)
  model = "ESP32-S3";
#endif

#if defined(CONFIG_IDF_TARGET_ESP32C6)
  model = "ESP32-C6";
#endif

#if defined(CONFIG_IDF_TARGET_ESP32P4)
  model = "ESP32-P4";
#endif

  if (esp_flash_get_size(NULL, &flash_size) != ESP_OK)
  {
    printf("Get flash size failed");
    flash_size = 0;
  }

  printf("\r\n%s\r\n", CP_STRING);
  printf("Product version: %u.%u.%u\r\n", PROD_VER0, PROD_VER1, PROD_VER2);
  printf("API version: %u\r\n", API_VER);
  printf("Feature version: %u\r\n", FEAT_VER);
  printf("Build: " __DATE__ ", " __TIME__ "\r\n");
  printf("\r\n");

  printf("Chip info:\r\n");
  printf("\tModel: %s (model ID %d)\r\n", model, info.model);
  printf("\tSilicon revision: %d\r\n", info.revision);
  printf("\tFrequency: %dMHz\r\n", esp_clk_cpu_freq() / 1000000);
  printf("\tCores: %d\r\n", info.cores);

  printf("\tFeatures:\r\n");
  if (info.features & CHIP_FEATURE_WIFI_BGN) printf("\t  WiFi 802.11bgn\r\n");
  if (info.features & CHIP_FEATURE_BLE) printf("\t  BLE\r\n");
  if (info.features & CHIP_FEATURE_BT) printf("\t  BT\r\n");
  if (info.features & CHIP_FEATURE_IEEE802154) printf("\t  IEEE 802.15.4\r\n");

  printf("\t%s %luMB\r\n",
         info.features & CHIP_FEATURE_EMB_FLASH ? "Embedded-Flash: " : "External-Flash: ",
         flash_size / (1024 * 1024));
  printf("\r\n");

  printf("IDF Version: %s\r\n", esp_get_idf_version());
  printf("\r\n");

  return 0;
}


const char *flash_vendor_str(uint8_t id)
{
  switch (id)
  {
    case 0x01: return "Spansion / Cypress / Infineon";
    case 0x1C: return "EON";
    case 0x20: return "ST / Numonyx / Micron family";
    case 0x31: return "Catalyst / Onsemi";
    case 0x62: return "Sanyo";
    case 0x68: return "Boya";
    case 0x85: return "Puya";
    case 0x8C: return "ESMT";
    case 0x9D: return "ISSI / PMC";
    case 0xAD: return "Bright / Hyundai";
    case 0xBF: return "SST / Microchip";
    case 0xC2: return "Macronix";
    case 0xC8: return "GigaDevice";
    case 0xD5: return "ISSI";
    case 0xEF: return "Winbond";
    default:   return "Unknown";
  }
}

const char *flash_mode_str()
{
#if defined(CONFIG_ESPTOOLPY_FLASHMODE_OPI)
  return "OPI";
#elif defined(CONFIG_ESPTOOLPY_FLASHMODE_QIO)
  return "QIO";
#elif defined(CONFIG_ESPTOOLPY_FLASHMODE_QOUT)
  return "QOUT";
#elif defined(CONFIG_ESPTOOLPY_FLASHMODE_DIO)
  return "DIO";
#elif defined(CONFIG_ESPTOOLPY_FLASHMODE_DOUT)
  return "DOUT";
#elif defined(CONFIG_ESPTOOLPY_FLASHMODE_SLOW_READ)
  return "SLOW_READ";
#else
  return "Unknown";
#endif
}

const char *flash_freq_str()
{
#if defined(CONFIG_ESPTOOLPY_FLASHFREQ_120M)
  return "120 MHz";
#elif defined(CONFIG_ESPTOOLPY_FLASHFREQ_80M)
  return "80 MHz";
#elif defined(CONFIG_ESPTOOLPY_FLASHFREQ_40M)
  return "40 MHz";
#elif defined(CONFIG_ESPTOOLPY_FLASHFREQ_26M)
  return "26.7 MHz";
#elif defined(CONFIG_ESPTOOLPY_FLASHFREQ_20M)
  return "20 MHz";
#elif defined(CONFIG_ESPTOOLPY_FLASHFREQ_16M)
  return "16 MHz";
#elif defined(CONFIG_ESPTOOLPY_FLASHFREQ_15M)
  return "15 MHz";
#elif defined(CONFIG_ESPTOOLPY_FLASHFREQ_12M)
  return "12 MHz";
#elif defined(CONFIG_ESPTOOLPY_FLASHFREQ_10M)
  return "10 MHz";
#elif defined(CONFIG_ESPTOOLPY_FLASHFREQ_5M)
  return "5 MHz";
#elif defined(CONFIG_ESPTOOLPY_FLASHFREQ_2M)
  return "2 MHz";
#else
  return "Unknown";
#endif
}

#define FLASH_MAX_PROTECT_REGIONS 64

typedef struct
{
  esp_flash_region_t region;
  esp_err_t state_err;
  bool protected_region;
} flash_protect_region_info_t;

typedef struct
{
  esp_flash_t *chip;
  esp_err_t id_err;
  esp_err_t size_hdr_err;
  esp_err_t size_phy_err;
  esp_err_t uid_err;
  esp_err_t chip_wp_err;
  esp_err_t regions_err;
  uint32_t id;
  uint32_t size_hdr;
  uint32_t size_phy;
  uint64_t uid;
  bool quad;
  bool chip_wp;
  bool unique_id_supported;
  bool chip_suspend_known;
  bool chip_suspend_supported;
  uint32_t regions_total;
  uint32_t regions_count;
  flash_protect_region_info_t regions[FLASH_MAX_PROTECT_REGIONS];
} flash_info_data_t;

bool flash_chip_suspend_cap(esp_flash_t *chip, bool *supported)
{
  *supported = false;

