tslabs/zx-evo/pentevo/esp32/src/main/system.cpp
#if HAVE_ESP_FLASH_CHIP_DRIVER_H
  if (!chip || !chip->chip_drv || !chip->chip_drv->get_chip_caps) return false;

  spi_flash_caps_t caps = chip->chip_drv->get_chip_caps(chip);
  *supported = (caps & SPI_FLASH_CHIP_CAP_SUSPEND) != 0;
  return true;
#else
  return false;
#endif
}

void flash_collect_info(esp_flash_t *chip, flash_info_data_t *info)
{
  memset(info, 0, sizeof(*info));
  info->chip = chip;
  info->uid_err = ESP_ERR_NOT_SUPPORTED;
  info->chip_wp_err = ESP_ERR_INVALID_STATE;
  info->regions_err = ESP_ERR_INVALID_STATE;

  info->id_err = esp_flash_read_id(chip, &info->id);
  info->size_hdr_err = esp_flash_get_size(chip, &info->size_hdr);
  info->size_phy_err = esp_flash_get_physical_size(chip, &info->size_phy);
  info->uid_err = esp_flash_read_unique_chip_id(chip, &info->uid);
  info->unique_id_supported = (info->uid_err == ESP_OK);
  info->quad = esp_flash_is_quad_mode(chip);
  info->chip_suspend_known = flash_chip_suspend_cap(chip, &info->chip_suspend_supported);
  info->chip_wp_err = esp_flash_get_chip_write_protect(chip, &info->chip_wp);

  const esp_flash_region_t *regions = NULL;
  info->regions_err = esp_flash_get_protectable_regions(chip, &regions, &info->regions_total);
  if (info->regions_err != ESP_OK) return;

  info->regions_count = info->regions_total;
  if (info->regions_count > FLASH_MAX_PROTECT_REGIONS) info->regions_count = FLASH_MAX_PROTECT_REGIONS;

  for (uint32_t i = 0; i < info->regions_count; i++)
  {
    info->regions[i].region = regions[i];
    info->regions[i].state_err = esp_flash_get_protected_region(chip, &regions[i], &info->regions[i].protected_region);
  }
}

void flash_print_protect_regions(const flash_info_data_t *info)
{
  if (info->regions_err != ESP_OK)
  {
    printf("Protection map: n/a (%s)\r\n", esp_err_to_name(info->regions_err));
    return;
  }

  printf("Protection map:\r\n");

  for (uint32_t i = 0; i < info->regions_count; i++)
  {
    const flash_protect_region_info_t *r = &info->regions[i];

    printf
    (
      "  %2" PRIu32 ": %08" PRIX32 "..%08" PRIX32 "  %8" PRIu32 " KB  ",
      i,
      r->region.offset,
      r->region.offset + r->region.size - 1,
      r->region.size / 1024
    );

    if (r->state_err == ESP_OK) printf("%s", r->protected_region ? "protected" : "open");
    else printf("state n/a (%s)", esp_err_to_name(r->state_err));

    printf("\r\n");
  }

  if (info->regions_total > info->regions_count)
    printf("  ... clipped: %" PRIu32 " regions not printed\r\n", info->regions_total - info->regions_count);
}

const char *flash_part_type_str(uint8_t type)
{
  switch (type)
  {
    case ESP_PARTITION_TYPE_APP:             return "app";
    case ESP_PARTITION_TYPE_DATA:            return "data";
    case ESP_PARTITION_TYPE_BOOTLOADER:      return "bootldr";
    case ESP_PARTITION_TYPE_PARTITION_TABLE: return "ptable";
    default:                                 return "custom";
  }
}

const char *flash_part_subtype_str(uint8_t type, uint8_t subtype)
{
  if (type == ESP_PARTITION_TYPE_BOOTLOADER)
  {
    switch (subtype)
    {
      case ESP_PARTITION_SUBTYPE_BOOTLOADER_PRIMARY:  return "primary";
      case ESP_PARTITION_SUBTYPE_BOOTLOADER_OTA:      return "ota";
      case ESP_PARTITION_SUBTYPE_BOOTLOADER_RECOVERY: return "recovery";
      default:                                        return "unknown";
    }
  }

  if (type == ESP_PARTITION_TYPE_PARTITION_TABLE)
  {
    switch (subtype)
    {
      case ESP_PARTITION_SUBTYPE_PARTITION_TABLE_PRIMARY: return "primary";
      case ESP_PARTITION_SUBTYPE_PARTITION_TABLE_OTA:     return "ota";
      default:                                            return "unknown";
    }
  }

  if (type == ESP_PARTITION_TYPE_APP)
  {
    if (subtype == ESP_PARTITION_SUBTYPE_APP_FACTORY) return "factory";
    if (subtype >= ESP_PARTITION_SUBTYPE_APP_OTA_MIN && subtype < ESP_PARTITION_SUBTYPE_APP_OTA_MAX) return "ota_x";
    if (subtype >= ESP_PARTITION_SUBTYPE_APP_TEE_MIN && subtype <= ESP_PARTITION_SUBTYPE_APP_TEE_MAX) return "tee_x";

    switch (subtype)
    {
      case ESP_PARTITION_SUBTYPE_APP_TEST: return "test";
      default:                             return "unknown";
    }
  }

  if (type == ESP_PARTITION_TYPE_DATA)
  {
    switch (subtype)
    {
      case ESP_PARTITION_SUBTYPE_DATA_OTA:       return "ota";
      case ESP_PARTITION_SUBTYPE_DATA_PHY:       return "phy";
      case ESP_PARTITION_SUBTYPE_DATA_NVS:       return "nvs";
      case ESP_PARTITION_SUBTYPE_DATA_COREDUMP:  return "coredump";
      case ESP_PARTITION_SUBTYPE_DATA_NVS_KEYS:  return "nvs_keys";
      case ESP_PARTITION_SUBTYPE_DATA_EFUSE_EM:  return "efuse_em";
      case ESP_PARTITION_SUBTYPE_DATA_UNDEFINED: return "undef";
      case ESP_PARTITION_SUBTYPE_DATA_ESPHTTPD:  return "esphttpd";
      case ESP_PARTITION_SUBTYPE_DATA_FAT:       return "fat";
      case ESP_PARTITION_SUBTYPE_DATA_SPIFFS:    return "spiffs";
      case ESP_PARTITION_SUBTYPE_DATA_LITTLEFS:  return "littlefs";
      case 0x84:                                 return "tsf";
      case ESP_PARTITION_SUBTYPE_DATA_TEE_OTA:   return "tee_ota";
      default:                                   return "unknown";
    }
  }

  return "unknown";
}

typedef struct
{
  uint32_t address;
  uint32_t size;
} flash_region_info_t;

void flash_region_insert_sorted(flash_region_info_t *regions, int *count, int max_count, uint32_t address, uint32_t size)
{
  if (*count >= max_count) return;

  int pos = *count;
  while (pos > 0 && regions[pos - 1].address > address)
  {
    regions[pos] = regions[pos - 1];
    pos--;
  }

  regions[pos].address = address;
  regions[pos].size = size;
  (*count)++;
}

void flash_region_add_system(flash_region_info_t *regions, int *count, int max_count)
{
  flash_region_insert_sorted(regions, count, max_count, 0x00000000, CONFIG_PARTITION_TABLE_OFFSET);
  flash_region_insert_sorted(regions, count, max_count, CONFIG_PARTITION_TABLE_OFFSET, 0x1000);
}

int flash_collect_regions(flash_region_info_t *regions, int max_count)
{
  int count = 0;
  esp_partition_iterator_t it;

  flash_region_add_system(regions, &count, max_count);

  it = esp_partition_find(ESP_PARTITION_TYPE_ANY, ESP_PARTITION_SUBTYPE_ANY, NULL);
  while (it)
  {
    const esp_partition_t *p = esp_partition_get(it);
    if (p) flash_region_insert_sorted(regions, &count, max_count, p->address, p->size);
    it = esp_partition_next(it);
  }

  esp_partition_iterator_release(it);
  return count;
}

