tslabs/zx-evo/pentevo/esp32/src/main/system.cpp
void flash_print_partition_line(int idx, uint32_t address, uint32_t size, uint32_t erase_size, const char *flags, const char *type_s, const char *sub_s, const char *label)
{
  printf
  (
    "%3d  %08" PRIX32 "  %08" PRIX32 "  %7" PRIu32 "  %5" PRIu32 "  %-5s  %-7s/%-8s  %s\r\n",
    idx,
    address,
    address + size - 1,
    size / 1024,
    erase_size,
    flags,
    type_s,
    sub_s,
    label
  );
}

void flash_print_partitions(uint32_t flash_size)
{
  printf("\r\n");
  printf("Partitions:\r\n");
  printf("Idx  Address   End       Size KB  Erase  Flags  Type/SubType      Label\r\n");

  int idx = 0;
  esp_partition_iterator_t it;

  flash_print_partition_line(idx++, 0x00000000, CONFIG_PARTITION_TABLE_OFFSET, 0x1000, "-", "bootldr", "primary", "bootloader");
  flash_print_partition_line(idx++, CONFIG_PARTITION_TABLE_OFFSET, 0x1000, 0x1000, "-", "ptable", "primary", "partition_table");

  it = esp_partition_find(ESP_PARTITION_TYPE_ANY, ESP_PARTITION_SUBTYPE_ANY, NULL);
  while (it)
  {
    const esp_partition_t *p = esp_partition_get(it);
    const char *type_s = flash_part_type_str(p->type);
    const char *sub_s = flash_part_subtype_str(p->type, p->subtype);
    char flags[8];
    int f = 0;

    if (p->encrypted) flags[f++] = 'E';
    if (p->readonly) flags[f++] = 'R';
    if (!f) flags[f++] = '-';
    flags[f] = 0;

    flash_print_partition_line(idx++, p->address, p->size, p->erase_size, flags, type_s, sub_s, p->label[0] ? p->label : "-");
    it = esp_partition_next(it);
  }

  esp_partition_iterator_release(it);

  flash_region_info_t regions[128];
  int region_count = flash_collect_regions(regions, 128);
  uint32_t used = 0;

  for (int i = 0; i < region_count; i++)
    used += regions[i].size;

  printf("\r\n");
  printf("Coverage:\r\n");
  printf("  Used by regions    : %" PRIu32 " bytes (%" PRIu32 " KB)\r\n", used, used / 1024);
  if (flash_size >= used) printf("  Free in flash      : %" PRIu32 " bytes (%" PRIu32 " KB)\r\n", flash_size - used, (flash_size - used) / 1024);
  else printf("  Free in flash      : overflow (%" PRIu32 " bytes over)\r\n", used - flash_size);

  printf("\r\n");
  printf("Free gaps:\r\n");

  if (region_count <= 0)
  {
    printf("  none\r\n");
    return;
  }

  uint32_t prev_end = 0;
  bool found_gap = false;

  for (int i = 0; i < region_count; i++)
  {
    uint32_t start = regions[i].address;
    uint32_t end = regions[i].address + regions[i].size;

    if (start > prev_end)
    {
      printf("  %08" PRIX32 "..%08" PRIX32 "  %" PRIu32 " bytes (%" PRIu32 " KB)\r\n", prev_end, start - 1, start - prev_end, (start - prev_end) / 1024);
      found_gap = true;
    }

    if (end > prev_end) prev_end = end;
  }

  if (flash_size > prev_end)
  {
    printf("  %08" PRIX32 "..%08" PRIX32 "  %" PRIu32 " bytes (%" PRIu32 " KB)\r\n", prev_end, flash_size - 1, flash_size - prev_end, (flash_size - prev_end) / 1024);
    found_gap = true;
  }

  if (!found_gap) printf("  none\r\n");
}

int flash_info()
{
  esp_flash_t *chip = esp_flash_default_chip;
  flash_info_data_t info;

  if (!chip)
  {
    printf("Main flash chip is not initialized\r\n");
    return 1;
  }

  flash_collect_info(chip, &info);

  printf("Flash info:\r\n");

  if (info.id_err == ESP_OK)
  {
    const uint8_t mf_id = (info.id >> 16) & 0xFF;
    const uint8_t mem_type = (info.id >> 8) & 0xFF;
    const uint8_t cap_code = info.id & 0xFF;

    printf("  JEDEC ID        : %06" PRIX32 "\r\n", info.id & 0xFFFFFF);
    printf("  Manufacturer    : %02X (%s)\r\n", mf_id, flash_vendor_str(mf_id));
    printf("  Memory type     : %02X\r\n", mem_type);
    printf("  Capacity code   : %02X\r\n", cap_code);
  }
  else
  {
    printf("  JEDEC ID        : n/a (%s)\r\n", esp_err_to_name(info.id_err));
  }

  if (info.size_hdr_err == ESP_OK) printf("  Header size     : %" PRIu32 " bytes (%" PRIu32 " MB)\r\n", info.size_hdr, info.size_hdr / (1024 * 1024));
  else printf("  Header size     : n/a (%s)\r\n", esp_err_to_name(info.size_hdr_err));

  if (info.size_phy_err == ESP_OK) printf("  Physical size   : %" PRIu32 " bytes (%" PRIu32 " MB)\r\n", info.size_phy, info.size_phy / (1024 * 1024));
  else printf("  Physical size   : n/a (%s)\r\n", esp_err_to_name(info.size_phy_err));

  if (info.uid_err == ESP_OK) printf("  Unique ID       : %016" PRIX64 "\r\n", info.uid);
  else if (info.uid_err == ESP_ERR_NOT_SUPPORTED) printf("  Unique ID       : not supported\r\n");
  else printf("  Unique ID       : n/a (%s)\r\n", esp_err_to_name(info.uid_err));

  printf("  Active quad     : %s\r\n", info.quad ? "yes" : "no");
  printf("  Boot mode       : %s\r\n", flash_mode_str());
  printf("  Boot freq       : %s\r\n", flash_freq_str());

#if defined(CONFIG_SPI_FLASH_AUTO_SUSPEND)
  printf("  Auto suspend cfg: enabled\r\n");
#else
  printf("  Auto suspend cfg: disabled\r\n");
#endif

  if (info.chip_suspend_known) printf("  Chip suspend cap: %s\r\n", info.chip_suspend_supported ? "yes" : "no");
  else printf("  Chip suspend cap: n/a\r\n");

  if (info.size_phy_err == ESP_OK)
    printf("  32-bit addr     : %s\r\n", info.size_phy > (16 * 1024 * 1024) ? "required" : "not required");

  if (info.chip_wp_err == ESP_OK) printf("  Chip WProtect   : %s\r\n", info.chip_wp ? "enabled" : "disabled");
  else printf("  Chip WProtect   : n/a (%s)\r\n", esp_err_to_name(info.chip_wp_err));

  printf("\r\n");
  printf("Capabilities:\r\n");
  printf("  Read ID           : %s\r\n", info.id_err == ESP_OK ? "yes" : "no / unknown");
  printf("  Read/Write/Erase  : yes\r\n");
  printf("  Unique ID         : %s\r\n", info.unique_id_supported ? "yes" : "no / unknown");
  printf("  Quad read mode    : %s\r\n", info.quad ? "active" : "inactive");
  if (info.chip_suspend_known) printf("  Suspend/Resume    : %s\r\n", info.chip_suspend_supported ? "supported by chip" : "not supported by chip");
  else printf("  Suspend/Resume    : n/a\r\n");
  if (info.regions_err == ESP_OK) printf("  Region protect    : yes (%" PRIu32 " regions)\r\n", info.regions_total);
  else printf("  Region protect    : unsupported (%s)\r\n", esp_err_to_name(info.regions_err));

  printf("  Part table offset : %08X\r\n", CONFIG_PARTITION_TABLE_OFFSET);
#if defined(CONFIG_PARTITION_TABLE_FILENAME)
  printf("  Part table file   : %s\r\n", CONFIG_PARTITION_TABLE_FILENAME);
#endif

  printf("\r\n");
  flash_print_protect_regions(&info);
  flash_print_partitions((info.size_phy_err == ESP_OK && info.size_phy) ? info.size_phy : info.size_hdr);

