tslabs/zx-evo/pentevo/esp32/src/main/system.cpp
  return 0;
}

int fl_cmd(int argc, char **argv)
{
  if (argc < 2)
  {
    printf("Usage:\r\n");
    printf("  fl info\r\n");
    return 0;
  }

  if (!strcmp(argv[1], "info"))
    return flash_info();

  printf("Unknown subcommand: %s\r\n", argv[1]);
  printf("Usage:\r\n");
  printf("  fl info\r\n");
  return 1;
}

int restart(int argc, char **argv)
{
  ESP_LOGI(TAG, "Restarting");
  esp_restart();
}

#define TESTHEAP_SLOTS              256
#define TESTHEAP_DEFAULT_MIN_ALLOC  1
#define TESTHEAP_DEFAULT_MAX_ALLOC  (4 * 1024 * 1024)
#define TESTHEAP_PROBE_STEP         4096

typedef struct
{
  void *ptr;
  size_t size;
} testheap_slot_t;

uint32_t testheap_rnd(uint32_t *state)
{
  uint32_t x = *state;

  if (!x) x = 0xA5A55A5A;

  x ^= x << 13;
  x ^= x >> 17;
  x ^= x << 5;

  *state = x;
  return x;
}

bool testheap_parse_size(const char *s, size_t *out)
{
  if (!s || !s[0] || !out) return false;

  char *end = NULL;
  unsigned long long value = strtoull(s, &end, 0);
  if (end == s) return false;

  unsigned long long mul = 1;

  if (end[0])
  {
    if (!end[1] && (end[0] == 'k' || end[0] == 'K')) mul = 1024ULL;
    else if (!end[1] && (end[0] == 'm' || end[0] == 'M')) mul = 1024ULL * 1024ULL;
    else return false;
  }

  if (value > (unsigned long long)SIZE_MAX / mul) return false;

  *out = (size_t)(value * mul);
  return true;
}

size_t testheap_random_size(uint32_t *state, size_t min_size, size_t max_size)
{
  uint64_t range = (uint64_t)max_size - (uint64_t)min_size + 1;
  uint64_t rnd = ((uint64_t)testheap_rnd(state) << 32) ^ testheap_rnd(state);

  if (range <= 1) return min_size;

  return min_size + (size_t)(rnd % range);
}

int testheap_first_empty_slot(testheap_slot_t *slots, int count)
{
  for (int i = 0; i < count; i++)
    if (!slots[i].ptr)
      return i;

  return -1;
}

int testheap_random_used_slot(testheap_slot_t *slots, int count, uint32_t *state)
{
  int used = 0;

  for (int i = 0; i < count; i++)
    if (slots[i].ptr)
      used++;

  if (!used) return -1;

  int target = testheap_rnd(state) % used;

  for (int i = 0; i < count; i++)
  {
    if (!slots[i].ptr) continue;
    if (!target) return i;
    target--;
  }

  return -1;
}

void testheap_free_slot(testheap_slot_t *slots, int idx, int *active_count, size_t *held_bytes)
{
  if (!slots[idx].ptr) return;

  heap_caps_free(slots[idx].ptr);

  if (*held_bytes >= slots[idx].size) *held_bytes -= slots[idx].size;
  else *held_bytes = 0;

  slots[idx].ptr = NULL;
  slots[idx].size = 0;

  if (*active_count > 0) (*active_count)--;
}

void testheap_touch(void *ptr, size_t size, uint32_t value)
{
  uint8_t *p = (uint8_t *)ptr;

  if (!p || !size) return;

  p[0] = (uint8_t)value;
  p[size - 1] = (uint8_t)(value >> 8);
}

void testheap_print_status(const char *prefix, uint32_t iter, uint32_t ok, uint32_t fail, uint32_t frees, uint32_t slow, int active, size_t held, uint64_t sum_us, uint64_t max_us)
{
  size_t free_size = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
  size_t largest = heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM);
  uint64_t avg_us = ok ? sum_us / ok : 0;

  printf
  (
    "%s iter=%" PRIu32 " ok=%" PRIu32 " fail=%" PRIu32 " free=%u largest=%u active=%d held=%u avg_us=%" PRIu64 " max_us=%" PRIu64 " frees=%" PRIu32 " slow=%" PRIu32 "\r\n",
    prefix,
    iter,
    ok,
    fail,
    (unsigned)free_size,
    (unsigned)largest,
    active,
    (unsigned)held,
    avg_us,
    max_us,
    frees,
    slow
  );
}

size_t testheap_probe_largest(size_t *free_before, size_t *idf_largest, uint32_t *tries, uint64_t *probe_us)
{
  size_t free_size = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
  size_t idf_size = heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM);
  size_t first_ok = 0;
  size_t prev_fail = 0;
  size_t result = 0;
  uint32_t cnt = 0;
  int64_t t0 = esp_timer_get_time();

  if (free_before) *free_before = free_size;
  if (idf_largest) *idf_largest = idf_size;

  for (size_t n = free_size; n > 0;)
  {
    cnt++;
    void *ptr = heap_caps_malloc(n, MALLOC_CAP_SPIRAM);

    if (ptr)
    {
      heap_caps_free(ptr);
      first_ok = n;
      break;
    }

    prev_fail = n;

    if (n == 1) break;
    if (n > TESTHEAP_PROBE_STEP) n -= TESTHEAP_PROBE_STEP;
    else n = 1;
  }

  result = first_ok;

  if (first_ok && prev_fail > first_ok)
  {
    size_t hi = prev_fail - 1;

    for (size_t n = hi; n > first_ok; n--)
    {
      cnt++;
      void *ptr = heap_caps_malloc(n, MALLOC_CAP_SPIRAM);

      if (ptr)
      {
        heap_caps_free(ptr);
        result = n;
        break;
      }
    }
  }

  int64_t t1 = esp_timer_get_time();

  if (tries) *tries = cnt;
  if (probe_us) *probe_us = (uint64_t)(t1 - t0);

  return result;
}

void testheap_print_largest_probe()
{
  size_t free_before = 0;
  size_t idf_largest = 0;
  uint32_t tries = 0;
  uint64_t probe_us = 0;
  size_t brute_largest = testheap_probe_largest(&free_before, &idf_largest, &tries, &probe_us);
  int64_t diff = (int64_t)brute_largest - (int64_t)idf_largest;

  printf("\r\n");
  printf("Largest PSRAM allocation probe:\r\n");
  printf("  free before       : %u bytes\r\n", (unsigned)free_before);
  printf("  IDF largest block : %u bytes\r\n", (unsigned)idf_largest);
  printf("  brute largest     : %u bytes\r\n", (unsigned)brute_largest);
  printf("  diff brute-IDF    : %" PRId64 " bytes\r\n", diff);
  printf("  brute tries       : %" PRIu32 "\r\n", tries);
  printf("  brute time        : %" PRIu64 " us\r\n", probe_us);
}

int testheap_cmd(int argc, char **argv)
{
  testheap_slot_t slots[TESTHEAP_SLOTS];
  memset(slots, 0, sizeof(slots));

  size_t min_alloc = TESTHEAP_DEFAULT_MIN_ALLOC;
  size_t max_alloc = TESTHEAP_DEFAULT_MAX_ALLOC;

  if (argc > 3 || (argc >= 2 && !testheap_parse_size(argv[1], &min_alloc)) || (argc >= 3 && !testheap_parse_size(argv[2], &max_alloc)) || min_alloc < 1 || max_alloc < min_alloc)
  {
    printf("Usage:\r\n");
    printf("  testheap [min_size] [max_size]\r\n");
    printf("\r\n");
    printf("Sizes are bytes by default. Suffixes k/K and m/M are accepted.\r\n");
    printf("Default: testheap %u %u\r\n", (unsigned)TESTHEAP_DEFAULT_MIN_ALLOC, (unsigned)TESTHEAP_DEFAULT_MAX_ALLOC);
    return 1;
  }

  uint32_t rng = (uint32_t)esp_timer_get_time() ^ (uint32_t)heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
  if (!rng) rng = 0x12345678;

  uint32_t iter = 0;
  uint32_t ok = 0;
  uint32_t fail = 0;
  uint32_t frees = 0;
  uint32_t slow = 0;
  uint32_t slow_prints = 0;
  uint64_t sum_us = 0;
  uint64_t max_us = 0;
  uint64_t avg_us_x1024 = 0;
  size_t held = 0;
  int active = 0;
  bool fragmented = false;
  bool user_stop = false;
  bool no_victim = false;

  printf("\r\n");
  printf("PSRAM heap fragmentation test\r\n");
  printf("  slots       : %d\r\n", TESTHEAP_SLOTS);
  printf("  alloc range : %u..%u bytes\r\n", (unsigned)min_alloc, (unsigned)max_alloc);
  printf("  stop        : fragmentation detected or any key\r\n");
  testheap_print_status("start", iter, ok, fail, frees, slow, active, held, sum_us, max_us);

  while (1)
  {
    char c;
    if (uart_read_bytes(UART_NUM_0, &c, 1, 0) > 0)
    {
      user_stop = true;
      break;
    }

    iter++;

