tslabs/zx-evo/pentevo/esp32/src/main/system.cpp
    int slot = testheap_first_empty_slot(slots, TESTHEAP_SLOTS);
    if (slot < 0)
    {
      slot = testheap_random_used_slot(slots, TESTHEAP_SLOTS, &rng);
      if (slot < 0)
      {
        no_victim = true;
        break;
      }

      testheap_free_slot(slots, slot, &active, &held);
      frees++;
    }

    size_t req = testheap_random_size(&rng, min_alloc, max_alloc);
    void *ptr = NULL;
    uint64_t alloc_us = 0;

    while (1)
    {
      int64_t t0 = esp_timer_get_time();
      ptr = heap_caps_malloc(req, MALLOC_CAP_SPIRAM);
      int64_t t1 = esp_timer_get_time();

      alloc_us = (uint64_t)(t1 - t0);

      if (ptr) break;

      fail++;

      size_t free_size = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
      size_t largest = heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM);

      if (free_size >= req)
      {
        printf
        (
          "\r\nFRAGMENTATION DETECTED: request=%u free=%u largest=%u active=%d held=%u\r\n",
          (unsigned)req,
          (unsigned)free_size,
          (unsigned)largest,
          active,
          (unsigned)held
        );

        fragmented = true;
        break;
      }

      int victim = testheap_random_used_slot(slots, TESTHEAP_SLOTS, &rng);
      if (victim < 0)
      {
        printf
        (
          "\r\nALLOC FAILED: request=%u free=%u largest=%u, no buffers to free\r\n",
          (unsigned)req,
          (unsigned)free_size,
          (unsigned)largest
        );

        no_victim = true;
        break;
      }

      testheap_free_slot(slots, victim, &active, &held);
      frees++;
    }

    if (fragmented || no_victim) break;

    slots[slot].ptr = ptr;
    slots[slot].size = req;
    active++;
    held += req;
    testheap_touch(ptr, req, iter);

    ok++;
    sum_us += alloc_us;
    if (alloc_us > max_us) max_us = alloc_us;

    uint64_t prev_avg_us_x1024 = avg_us_x1024 ? avg_us_x1024 : alloc_us * 1024;
    bool slow_alloc = ok > 32 && alloc_us > 1000 && alloc_us * 1024 > prev_avg_us_x1024 * 8;

    if (!avg_us_x1024) avg_us_x1024 = alloc_us * 1024;
    else avg_us_x1024 = (avg_us_x1024 * 63 + alloc_us * 1024) / 64;

    if (slow_alloc)
    {
      slow++;

      if (slow_prints < 16)
      {
        size_t free_size = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
        size_t largest = heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM);

        printf
        (
          "SLOW ALLOC: iter=%" PRIu32 " request=%u alloc_us=%" PRIu64 " avg_us=%" PRIu64 " free=%u largest=%u\r\n",
          iter,
          (unsigned)req,
          alloc_us,
          prev_avg_us_x1024 / 1024,
          (unsigned)free_size,
          (unsigned)largest
        );

        slow_prints++;
      }
    }

    if ((ok & 0xFF) == 0)
      testheap_print_status("run  ", iter, ok, fail, frees, slow, active, held, sum_us, max_us);
  }

  testheap_print_status("stop ", iter, ok, fail, frees, slow, active, held, sum_us, max_us);
  testheap_print_largest_probe();

  for (int i = 0; i < TESTHEAP_SLOTS; i++)
    testheap_free_slot(slots, i, &active, &held);

  if (fragmented) printf("Result: stopped on fragmentation condition\r\n");
  else if (user_stop) printf("Result: stopped by user\r\n");
  else if (no_victim) printf("Result: stopped, no buffer can be freed\r\n");
  else printf("Result: stopped\r\n");

  testheap_print_status("final", iter, ok, fail, frees, slow, active, held, sum_us, max_us);

  return fragmented ? 1 : 0;
}

void print_heap_region_info(const char *name, uint32_t caps)
{
  multi_heap_info_t info = {};
  heap_caps_get_info(&info, caps);

  size_t total = heap_caps_get_total_size(caps);
  size_t fragmented = 0;
  unsigned fragmented_pct = 0;

  if (info.total_free_bytes > info.largest_free_block)
    fragmented = info.total_free_bytes - info.largest_free_block;

  if (info.total_free_bytes)
    fragmented_pct = (unsigned)((fragmented * 100) / info.total_free_bytes);

  printf(" %s:\r\n", name);
  printf("   total          : %u\r\n", (unsigned)total);
  printf("   free           : %u\r\n", (unsigned)info.total_free_bytes);
  printf("   allocated      : %u\r\n", (unsigned)info.total_allocated_bytes);
  printf("   largest free   : %u\r\n", (unsigned)info.largest_free_block);
  printf("   minimum free   : %u\r\n", (unsigned)info.minimum_free_bytes);
  printf("   fragmented     : %u (%u%%)\r\n", (unsigned)fragmented, fragmented_pct);
  printf("   free blocks    : %u\r\n", (unsigned)info.free_blocks);
  printf("   alloc blocks   : %u\r\n", (unsigned)info.allocated_blocks);
  printf("   total blocks   : %u\r\n", (unsigned)info.total_blocks);
}

int mem_info(int argc, char **argv)
{
  printf("Heap free/total:\r\n");
  printf(" Default:\t%u/%u\r\n",    heap_caps_get_free_size(MALLOC_CAP_DEFAULT), heap_caps_get_total_size(MALLOC_CAP_DEFAULT));
  printf(" 32-bit:\t%u/%u\r\n",     heap_caps_get_free_size(MALLOC_CAP_32BIT), heap_caps_get_total_size(MALLOC_CAP_32BIT));
  printf(" 8-bit:\t\t%u/%u\r\n",    heap_caps_get_free_size(MALLOC_CAP_8BIT), heap_caps_get_total_size(MALLOC_CAP_8BIT));
  printf(" SPI RAM:\t%u/%u\r\n",    heap_caps_get_free_size(MALLOC_CAP_SPIRAM), heap_caps_get_total_size(MALLOC_CAP_SPIRAM));
  printf(" SRAM:\t\t%u/%u\r\n",     heap_caps_get_free_size(MALLOC_CAP_INTERNAL), heap_caps_get_total_size(MALLOC_CAP_INTERNAL));
  printf(" DMA:\t\t%u/%u\r\n",      heap_caps_get_free_size(MALLOC_CAP_DMA), heap_caps_get_total_size(MALLOC_CAP_DMA));
  printf(" RTC fast:\t%u/%u\r\n",   heap_caps_get_free_size(MALLOC_CAP_RTCRAM), heap_caps_get_total_size(MALLOC_CAP_RTCRAM));
  printf(" Retention:\t%u/%u\r\n",  heap_caps_get_free_size(MALLOC_CAP_RETENTION), heap_caps_get_total_size(MALLOC_CAP_RETENTION));
  printf(" IRAM 8-bit:\t%u/%u\r\n", heap_caps_get_free_size(MALLOC_CAP_IRAM_8BIT), heap_caps_get_total_size(MALLOC_CAP_IRAM_8BIT));
  printf(" Exec:\t\t%u/%u\r\n",     heap_caps_get_free_size(MALLOC_CAP_EXEC), heap_caps_get_total_size(MALLOC_CAP_EXEC));

  printf("\r\nHeap details:\r\n");
  print_heap_region_info("SRAM", MALLOC_CAP_INTERNAL);
  print_heap_region_info("SPI RAM", MALLOC_CAP_SPIRAM);

