tslabs/zx-evo/pentevo/esp32/src/main/system.cpp
  return 0;
}

const char *obj_type_str(uint8_t t)
{
  switch (t)
  {
    case OBJ_TYPE_NONE:  return "None";
    case OBJ_TYPE_DATA:  return "Data";
    case OBJ_TYPE_DATAF: return "Data SRAM";
    case OBJ_TYPE_ELF:   return "ELF";
    case OBJ_TYPE_LIB:   return "LIB";
    case OBJ_TYPE_XM:    return "XM";
    case OBJ_TYPE_WAV:   return "WAV";
    case OBJ_TYPE_HST:   return "HST";
    case OBJ_TYPE_ZIP:   return "ZIP";
    case OBJ_TYPE_XMC:   return "XM ctx";
    case OBJ_TYPE_MOD:   return "MOD";
    case OBJ_TYPE_MDC:   return "MOD ctx";
    case OBJ_TYPE_S3M:   return "S3M";
    case OBJ_TYPE_S3C:   return "S3M ctx";
    default:             return "Unknown";
  }
}

const char *obj_state_str(uint8_t st)
{
  switch (st)
  {
    case OBJ_ST_NONE:       return "None";
    case OBJ_ST_ERROR:      return "Error";
    case LIB_OBJ_ST_READY:  return "Ready";
    case TRACK_OBJ_ST_STOPPED:  return "Stopped";
    case TRACK_OBJ_ST_PLAYING:  return "Playing";
    case WAV_OBJ_ST_PLAYING: return "Playing";
    case OBJ_ST_DELETING:    return "Deleting";
    default:                 return "Unknown";
  }
}

int obj_info(int argc, char **argv)
{
  printf("\r\nMemory objects\r\n");

  for (int i = 0; i < OBJ_HANDLES_MAX; i++)
    if (mem_obj[i].addr)
    {
      const uint8_t t = mem_obj[i].type;
      const uint8_t s = mem_obj[i].state;

      printf
      (
        "ID: %02X  Type: %02X (%s)  State: %02X (%s)  Addr: %08X  Size: %u\r\n",
        (unsigned)i,
        (unsigned)t, obj_type_str(t),
        (unsigned)s, obj_state_str(s),
        (unsigned int)mem_obj[i].addr,
        (unsigned)mem_obj[i].size
      );

      switch (mem_obj[i].type)
      {
        case OBJ_TYPE_LIB:
          printf("  Entry: %08X\r\n", (unsigned int)mem_obj[i].entry);
          printf("  Buffer       Addr      Size\r\n");

          if (mem_obj[i].text)
            printf("  %-10s  %08X  %u\r\n", "text", (unsigned int)mem_obj[i].text, (unsigned)mem_obj[i].sz_text);

          if (mem_obj[i].rodata)
            printf("  %-10s  %08X  %u\r\n", "rodata", (unsigned int)mem_obj[i].rodata, (unsigned)mem_obj[i].sz_rodata);

          if (mem_obj[i].data)
            printf("  %-10s  %08X  %u\r\n", "data", (unsigned int)mem_obj[i].data, (unsigned)mem_obj[i].sz_data);

          if (mem_obj[i].bss)
            printf("  %-10s  %08X  %u\r\n", "bss", (unsigned int)mem_obj[i].bss, (unsigned)mem_obj[i].sz_bss);
        break;

        case OBJ_TYPE_XMC:
        case OBJ_TYPE_MDC:
        case OBJ_TYPE_S3C:
        {
          const xm_context_t *ctx = (const xm_context_t*)mem_obj[i].addr;

          if (!tracker_context_has_registered_segments(ctx))
          {
            printf("  No registered tracker segments\r\n");
            break;
          }

          typedef struct tracker_segment_summary_s
          {
            uint8_t type;
            uint16_t count;
            size_t total_size;
            void *addr;
            size_t size;
          } tracker_segment_summary_t;

          tracker_segment_summary_t summary[] =
          {
            { TRACKER_CONTEXT_SEG_CONTEXT, 0, 0, NULL, 0 },
            { TRACKER_CONTEXT_SEG_RUNTIME, 0, 0, NULL, 0 },
            { TRACKER_CONTEXT_SEG_PATTERNS, 0, 0, NULL, 0 },
            { TRACKER_CONTEXT_SEG_INSTRUMENTS, 0, 0, NULL, 0 },
            { TRACKER_CONTEXT_SEG_SAMPLES, 0, 0, NULL, 0 },
            { TRACKER_CONTEXT_SEG_FORMAT_EXTRA, 0, 0, NULL, 0 }
          };

          uint16_t unknown_count = 0;
          size_t unknown_total_size = 0;
          uint16_t seg_count = tracker_context_get_segment_count(ctx);

          for (uint16_t j = 0; j < seg_count; j++)
          {
            tracker_context_segment_t seg;
            bool found = false;

            if (!tracker_context_get_segment(ctx, j, &seg)) continue;

            for (size_t k = 0; k < sizeof(summary) / sizeof(summary[0]); k++)
            {
              if (summary[k].type != seg.type) continue;

              summary[k].count++;
              summary[k].total_size += seg.size;

              if (summary[k].count == 1)
              {
                summary[k].addr = seg.addr;
                summary[k].size = seg.size;
              }

              found = true;
              break;
            }

            if (!found)
            {
              unknown_count++;
              unknown_total_size += seg.size;
            }
          }

          printf("  Buffer              Count  Addr      Size\r\n");

          for (size_t j = 0; j < sizeof(summary) / sizeof(summary[0]); j++)
          {
            const char *seg_type = "unknown";
            char name[32];

            if (!summary[j].count) continue;

            switch (summary[j].type)
            {
              case TRACKER_CONTEXT_SEG_CONTEXT:      seg_type = "context"; break;
              case TRACKER_CONTEXT_SEG_RUNTIME:      seg_type = "runtime"; break;
              case TRACKER_CONTEXT_SEG_PATTERNS:     seg_type = "patterns"; break;
              case TRACKER_CONTEXT_SEG_INSTRUMENTS:  seg_type = "instruments"; break;
              case TRACKER_CONTEXT_SEG_SAMPLES:      seg_type = "samples"; break;
              case TRACKER_CONTEXT_SEG_FORMAT_EXTRA: seg_type = "format-extra"; break;
              default: break;
            }

            if (summary[j].count > 1)
              snprintf(name, sizeof(name), "%s (%u)", seg_type, (unsigned)summary[j].count);
            else
              snprintf(name, sizeof(name), "%s", seg_type);

            if (summary[j].count == 1)
            {
              printf
              (
                "  %-18s  %5u  %08X  %u\r\n",
                name,
                (unsigned)summary[j].count,
                (unsigned int)summary[j].addr,
                (unsigned)summary[j].size
              );
            }
            else
            {
              printf
              (
                "  %-18s  %5u  %-8s  %u\r\n",
                name,
                (unsigned)summary[j].count,
                "multiple",
                (unsigned)summary[j].total_size
              );
            }
          }

