tslabs/zx-evo/pentevo/esp32/src/main/system.cpp
          if (unknown_count)
          {
            printf
            (
              "  %-18s  %5u  %-8s  %u\r\n",
              "unknown",
              (unsigned)unknown_count,
              "multiple",
              (unsigned)unknown_total_size
            );
          }
        }
        break;

        default:
        break;
      }
    }

  printf("\r\n");

  return 0;
}

#if WITH_TASKS_INFO
int tasks_info(int argc, char **argv)
{
  const size_t bytes_per_task = 40; /* see vTaskList description */
  char *task_list_buffer = (char*)malloc(uxTaskGetNumberOfTasks() * bytes_per_task);

  if (task_list_buffer == NULL)
  {
    ESP_LOGE(TAG, "failed to allocate buffer for vTaskList output");
    return 1;
  }

  printf("Task Name\tStatus\tPrio\tHWM*\tTask#");
#ifdef CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID
  printf("\tAffinity");
#endif
  printf("\r\n");
  vTaskList(task_list_buffer);
  printf(task_list_buffer);
  printf("*HWM = Free stack bytes\r\n\r\n");

  free(task_list_buffer);

  return 0;
}
#endif // WITH_TASKS_INFO

int stats_info(int argc, char **argv)
{
  printf("\r\nAudio render per 10 ms frame. Press any key to stop.\r\n");
  printf("format: source last/max cpu%%\r\n");

  while (1)
  {
    printf("trk %2d.%d/%2d.%d%% | opl %2d.%d/%2d.%d%% | sfx %2d.%d/%2d.%d%% | total %2d.%d/%2d.%d%%        \r",
      _st.audio_tracker_last_cpu_x10 / 10,
      _st.audio_tracker_last_cpu_x10 % 10,
      _st.audio_tracker_max_cpu_x10 / 10,
      _st.audio_tracker_max_cpu_x10 % 10,

      _st.audio_opl_last_cpu_x10 / 10,
      _st.audio_opl_last_cpu_x10 % 10,
      _st.audio_opl_max_cpu_x10 / 10,
      _st.audio_opl_max_cpu_x10 % 10,

      _st.audio_sfx_last_cpu_x10 / 10,
      _st.audio_sfx_last_cpu_x10 % 10,
      _st.audio_sfx_max_cpu_x10 / 10,
      _st.audio_sfx_max_cpu_x10 % 10,

      _st.audio_total_last_cpu_x10 / 10,
      _st.audio_total_last_cpu_x10 % 10,
      _st.audio_total_max_cpu_x10 / 10,
      _st.audio_total_max_cpu_x10 % 10);

    char c; if (uart_read_bytes(UART_NUM_0, &c, 1, 0)) break;
  }

  printf("\r\n");

  return 0;
}


int vol_cmd(int argc, char **argv)
{
  if (argc < 2)
  {
    printf("Output volume: %d\r\n", mix_volume);
    return 0;
  }

  char *endp = NULL;
  unsigned long value = strtoul(argv[1], &endp, 0);
  if (!endp || *endp || value > 255)
  {
    printf("Bad <volume>: %s (expected 0..255)\r\n", argv[1]);
    return 1;
  }

  mix_volume = (int)value;
  printf("Output volume: %d\r\n", mix_volume);
  return 0;
}

int nvs_show()
{
  esp_err_t err = app_params_load();
  if (err != ESP_OK)
  {
    printf("app_params_load failed: %s\r\n", esp_err_to_name(err));
    return 1;
  }

  printf("NVS params:\r\n");
  printf("  usb_mode : %u\r\n", app_params.usb_mode);
  printf("  wifi_mode: %u\r\n", app_params.wifi_mode);
  printf("  wifi_ap  : %s\r\n", app_params.wifi_ap[0] ? app_params.wifi_ap : "");
  printf("  wifi_psw : %s\r\n", app_params.wifi_psw[0] ? app_params.wifi_psw : "");

  return 0;
}

int nvs_cmd(int argc, char **argv)
{
  if (argc < 2)
  {
    printf("Usage:\r\n");
    printf("  nvs show\r\n");
    printf("  nvs set <name> <value>\r\n");
    return 0;
  }

  if (!strcmp(argv[1], "show"))
    return nvs_show();

  if (!strcmp(argv[1], "set"))
  {
    if (argc < 4)
    {
      printf("Usage: nvs set <name> <value>\r\n");
      return 1;
    }

    esp_err_t err = app_params_load();
    if (err != ESP_OK)
    {
      printf("app_params_load failed: %s\r\n", esp_err_to_name(err));
      return 1;
    }

    if (!app_params_set_by_name(argv[2], argv[3]))
    {
      printf("Bad name/value: %s = %s\r\n", argv[2], argv[3]);
      return 1;
    }

    err = app_params_save();
    if (err != ESP_OK)
    {
      printf("app_params_save failed: %s\r\n", esp_err_to_name(err));
      return 1;
    }

    printf("Saved: %s = %s\r\n", argv[2], argv[3]);
    return 0;
  }

  printf("Unknown subcommand: %s\r\n", argv[1]);
  printf("Usage:\r\n");
  printf("  nvs show\r\n");
  printf("  nvs set <name> <value>\r\n");
  return 1;
}

// ---------- Command registration ----------
void esp_console_register_system_commands()
{
  {
    const esp_console_cmd_t cmd =
    {
      .command = "errors",
      .help    = "Current error and help",
      .hint    = NULL,
      .func    = &error_list,
    };

    ESP_ERROR_CHECK(esp_console_cmd_register(&cmd));
  }

  {
    const esp_console_cmd_t cmd =
    {
      .command = "perf",
      .help    = "Performance test",
      .hint    = NULL,
      .func    = &perf_test,
    };

    ESP_ERROR_CHECK(esp_console_cmd_register(&cmd));
  }

  {
    const esp_console_cmd_t cmd =
    {
      .command = "info",
      .help    = "Get chip info",
      .hint    = NULL,
      .func    = &get_info,
    };

    ESP_ERROR_CHECK(esp_console_cmd_register(&cmd));
  }

#if WITH_TASKS_INFO
  {
    const esp_console_cmd_t cmd =
    {
      .command = "tasks",
      .help    = "Get information about running tasks",
      .hint    = NULL,
      .func    = &tasks_info,
    };

    ESP_ERROR_CHECK(esp_console_cmd_register(&cmd));
  }
#endif // WITH_TASKS_INFO

  {
    const esp_console_cmd_t cmd =
    {
      .command = "restart",
      .help    = "Software chip reset",
      .hint    = NULL,
      .func    = &restart,
    };

    ESP_ERROR_CHECK(esp_console_cmd_register(&cmd));
  }

  {
    const esp_console_cmd_t cmd =
    {
      .command = "memory",
      .help    = "Get the memory info",
      .hint    = NULL,
      .func    = &mem_info,
    };

    ESP_ERROR_CHECK(esp_console_cmd_register(&cmd));
  }

  {
    const esp_console_cmd_t cmd =
    {
      .command = "testheap",
      .help    = "PSRAM heap fragmentation test",
      .hint    = NULL,
      .func    = &testheap_cmd,
    };

    ESP_ERROR_CHECK(esp_console_cmd_register(&cmd));
  }

  {
    const esp_console_cmd_t cmd =
    {
      .command = "objects",
      .help    = "Get the memory objects info",
      .hint    = NULL,
      .func    = &obj_info,
    };

    ESP_ERROR_CHECK(esp_console_cmd_register(&cmd));
  }

  {
    const esp_console_cmd_t cmd =
    {
      .command = "stats",
      .help    = "Get audio render timing by source",
      .hint    = NULL,
      .func    = &stats_info,
    };

    ESP_ERROR_CHECK(esp_console_cmd_register(&cmd));
  }

  {
    const esp_console_cmd_t cmd =
    {
      .command = "vol",
      .help    = "Set output volume after mixer",
      .hint    = NULL,
      .func    = &vol_cmd,
    };

    ESP_ERROR_CHECK(esp_console_cmd_register(&cmd));
  }

  {
    const esp_console_cmd_t cmd =
    {
      .command  = "nvs",
      .help     = "NVS commands: show/set",
      .hint     = NULL,
      .func     = &nvs_cmd,
      .argtable = NULL
    };

    ESP_ERROR_CHECK(esp_console_cmd_register(&cmd));
  }

  {
    const esp_console_cmd_t cmd =
    {
      .command  = "fl",
      .help     = "Flash commands: info",
      .hint     = NULL,
      .func     = &fl_cmd,
      .argtable = NULL
    };

    ESP_ERROR_CHECK(esp_console_cmd_register(&cmd));
  }

  {
    const esp_console_cmd_t cmd =
    {
      .command  = "usb",
      .help     = "USB commands: en",
      .hint     = NULL,
      .func     = &usb_cmd,
      .argtable = NULL
    };

    ESP_ERROR_CHECK(esp_console_cmd_register(&cmd));
  }

  {
    // const esp_console_cmd_t cmd =
    // {
      // .command  = "btmouse",
      // .help     = "Start BLE mouse scan/connect mode, any key stops BT",
      // .hint     = NULL,
      // .func     = &bt_mouse_cmd,
      // .argtable = NULL
    // };

    // ESP_ERROR_CHECK(esp_console_cmd_register(&cmd));
  }
}
